#include <windows.h>
#include <stdio.h>

int find(int n, ...) {
    // n - число параметров переданных в функцию
    int mVal = 0; // значение элемента, найденого большее кол-во раз
    int mValN = 0; // кол-во вхождений mVal в массив

    int val = 0; // временная переменная для значение элемента
    int valN = 0; // хранит кол-во вхождений val в массив

    va_list args; // переменная(список), который хранит все параметры переданные в эту функцию. пуст

    // перепишем элементы из args в массив для более удобной обработки
    int *array = (int*) calloc(n, sizeof(int));
    va_start(args, n);
    for (int k = 0; k < n; k++) {
        array[k] = va_arg(args, int);
    }
    va_end(args);



    for (int j = 0; j < n; j++) { // цикл перебора всех элементов массива
        val = array[j];
        valN = 0;
        for (int i = j; i < n; i++) { // i = j для просмотра элементов массива, начиная с позиции со значением val
            if (array[i] == val){
                // если найдено еще одно значение val, увеличиваем счетчик
                valN++;
            }
        }
        if  (mValN <= valN){
            // если проверяемое значение входит большее колво раз, чем сохраненное ранее
            mVal = val; // обновляем его
            mValN = valN; // обновляем количество найденных mVal
        }
    }

    /*
     в данном месте кода

    mVal - содержит занчение переменной найденное максимальное кол-во раз
     (если массив содержит несколько переменных с одинаковымм числом вхождений, то mVal хранит значение последней из них)

    mValN - число вхождений переменной найденное максимальное кол-во раз
     */
    return mVal;
}


int main() {

    // первый параметр должен быть равен числу последующих параметров
    // в данном случает n=5

    int size = 5;
    int *array = (int *) calloc(size, sizeof(int));

    for (int i = 0; i < size; i++) {
        scanf("%d", &array[i]);
    }

    int val = find(size, array[0], array[1], array[2], array[3], array[4]); // поиск значения переменной
    printf("val: %d\n", val);
    system("pause");
}

