@echo off

:: Поиск файлов по маске в указанном каталоге и его подкаталогах. 
:: Маска задается параметром пакетного файла. Найденные файлы вывести. Предусмотреть одновременный ввод нескольких масок.

set @path1 =%1

:start

:: Изменение содержимого (сдвиг) подставляемых параметров для пакетного файла.
shift /1

if '%1' == '' goto :end

dir  /B /S %path1% %1
:: dir /B /S отображение файлов и подкатологов в ук. каталоге;
:: 		/B - вывод только имен файлов 
:: 		/S - поиск в каталоге и его подкаталогах


goto :start
:end

:: task1.bat test *.txt
:: task1.bat test *.txt *.bat