:: Перемещение файлов, в имении которых содержится больше трех знаков препинания, в другой подкаталог. 
:: Искомый каталог и каталог для перемещения передаются параметрами пакетному файлу. Перемещаемые файлы вывести.

@echo off

if exist %1 pushd %1 

:: for /f in do - обработка файлов
for /f %%i in ('dir %1 /b /s ^| findstr /R ".*[,.!?:;-].*[,.!?:;-].*[,.!?:;-].*[,.!?:;-].*"') do (
	copy "%%i" %2
	:: move
	echo %%i
)

popd

:: task4.bat E:\UNI\LVL2\PART2\OSiSP\lab5\t4\test E:\UNI\LVL2\PART2\OSiSP\lab5\t4\res