
:: Удаления файлов по заданному расширения в каталогах и их подкаталогах. 
:: Расширения (можно задать несколько) задаются параметром пакетного файла. Удаленные файлы вывести.


@echo off

:: pushd - запомнить текущий каталог и перейти к указанному каталогу
if exist %1 pushd %1


:start 

::  /P   Запрос подтверждения перед удалением каждого файла.
:: /S   Удаление указанных файлов из всех подкаталогов.
erase /P /S %2

shift /2
if not '%2' == '' goto :start



:: popd - вернуться к каталогу
popd

:: task2.bat test *.txt *.bat